const courses = [
  {
    point: { x: 843, y: 603 },
    course: "2019211304班-跨文化交流-周三15点(主校区)",
  },
  {
    point: { x: 225, y: 367 },
    course: "2019315406班-银行金融-周一10点(主校区)",
  },
  {
    point: { x: 966, y: 509 },
    course: "2020411321班-德语语言文化-周二13点(主校区)",
  },
  {
    point: { x: 671, y: 751 },
    course: "2018322402班-基础口译-周一14点(主校区)",
  },
  {
    point: { x: 199, y: 1268 },
    course: "2019471235班-古典音乐鉴赏-周五13点(主校区)",
  },
  {
    point: { x: 983, y: 821 },
    course: "舞会-周六20点(主校区)",
  },
  {
    point: { x: 253, y: 360 },
    course: "2019211305班-数据结构-周五8点(副校区)",
  },
  {
    point: { x: 253, y: 360 },
    course: "2019211307班-计算机组成原理-周三13点(副校区)",
  },
];
